<?php
/**
 * message file for saving message translations for Application in english language.
 * @author seniordev@ovmyanmar.com
 * Created On: 11/11/2022
 */

return [
    'api' => [
        'response' => [
            'error' => [
                'resource_not_found' => 'တောင်းဆိုသောအရင်းအမြစ်ကိုဆာဗာတွင်ရှာမတွေ့ပါ',
                'request_unauthorized' => 'သတ်မှတ်ထားသောလုပ်ငန်းကိုလုပ်ဆောင်ရန်တောင်းဆိုမှုသည်ခွင့်ပြုချက်မရှိပါ',
                'request_method_not_allowed' => 'သတ်မှတ်ထားသောလုပ်ငန်းကိုလုပ်ဆောင်ရန်တောင်းဆိုမှုသည်ခွင့်ပြုချက်မရှိပါ',
                'request_timed_out' =>
                'တောင်းဆိုမှု သက်တမ်းကုန်ဆုံးသွားပါပြီ။ဆိုလိုသည်မှာ ဆာဗာမှမျှော်မှန်းထားသောအချိန်ကာလအတွင်းတွင်တောင်းဆိုမှုကိုမရရှိနိုင်ပါ။',
                'internal_error' =>
                'ဆာဗာတွင်အမှားတစ်ခုဖြစ်ပွားခဲ့သည်။ အချို့သောအပိုအသေးစိတ်များသည်တုံ့ပြန်သောအရာဝတ္ထုတွင်တည်ရှိနေနိုင်သည်။',
                'gateway_timeout' => 'သတ်မှတ်ထားသောအချိန်အတွင်းဆာဗာမှတုံ့ပြန်မှုလက်ခံမရရှိပါ',
                'server_under_maintainance' => 'သတ်မှတ်ထားသောအချိန်အတွင်းဆာဗာမှတုံ့ပြန်မှုလက်ခံမရရှိပါ',
                'invalid_content_type' => 'အကြောင်းအရာအမျိုးအစားသည်ခေါင်းစဉ်တွင်သတ်မှတ်ထားခြင်းမရှိပါ။ (သို့မဟုတ်) အကြောင်းအရာအမျိုးအစားမမှန်ကန်ပါ။',
                'invalid_request_data' => 'မမှန်ကန်သောတောင်းဆိုမှုအကြောင်းအရာကြောင့် အပြန်အလှန်လုပ်ဆောင်ချက်ကိုပယ်ဖျက်သည်။',
                'invalid_content_length' => 'အကြောင်းအရာအရှည်ပမာဏမသတ်မှတ်ထားပါ (သို့မဟုတ်) မမှန်ကန်ပါ။',
                'invalid_content_md5' => 'အကြောင်းအရာ MD5ကိုမသတ်မှတ်ထားပါ (သို့မဟုတ်) မမှန်ကန်ပါ။',
                'invalid_date_time' => 'အသုံးပြုသည့်ရက်စွဲ/အချိန်သည်မမှန်ပါ',
                'empty_auth_header' => 'လုပ်ပိုင်ခွင့် နယ်ပယ်၌ ဒေတာ မရှိခြင်း (သို့) မသိသော ဒေတာများရှိသည်',
                'missing_auth_fields' => 'လုပ်ပိုင်ခွင့် ခေါင်းစဉ်တွင် ပျောက်ဆုံးနေသော အကြောင်းအရာ အချို့ရှိသည်။',
                'unauthenticated' =>'Unauthenticated.',
                'invalid_referer' => 'မမှန်ကန်သော ရည်ညွှန်းသူ',
                'invalid_session' => 'တောင်းဆိုမှုအပေါ်မမှန်ကန်သောခေါင်းစဉ်ရှိနေပါသည်။',
                'invalid_ip_address' => 'တောင်းဆိုမှုမှာ အိုင်ပီလိပ်စာမှားယွင်းနေပါသည်။',
                'invalid_http_method' => 'တောင်းဆိုမှုတွင်ရှိနေသော HTTPနည်းလမ်းမှားယွင်းနေပါသည်။',
                'invalid_token' => 'တောင်းဆိုမှုတွင်တိုကင်မှန်ကန်ခြင်းမရှိပါ။',
                'invalid_credentials' => 'အထောက်အထားများမမှန်ကန်ပါ။',
                
                'invalid_user_name' => 'အသုံးပြုအမည်မှားယွင်းနေပါသည်။',
                'invalid_email' => 'တောင်းဆိုမှုတွင်အီးမေးလ်မမှန်ကန်ပါ။',
                'invalid_password' => 'ပေးထားသောစကားဝှက်မမှန်ကန်ပါ။',
                'email_exist' => 'အသုံးပြုသူပေးထားသောအီးမေးလ်မှာတည်ရှိပြီးဖြစ်ပါသည်',
                'email_does_not_exist' => 'အီးမေးလ်နှင့်အသုံးပြုသူသည်မရှိပါ။ မတူညီသောအကောင့်တစ်ခုထည့်ပါ သို့မဟုတ် အသစ်တစ်ခုဖန်တီးပါ။',
                'invalid_user_identifier' => 'ဝမ်းနည်းပါတယ်။ ဤအသုံးပြုသူကိုမရရှိနိုင်ပါ။',
                'invalid_otp_request' => 'အတည်ပြုကုဒ်နံပါတ်မှားယွင်းနေပါသည်။',
                'otp_already_verified' => 'အတည်ပြုကုဒ်အတည်ပြုပြီးပါပြီ။',
                'password_confirm_password_does_not_match' => 'စကားဝှက်အသစ်နှင့်အတည်ပြုစကားဝှက် ကိုက်ညီမှုမရှိပါ။',
                'invalid_device_id' =>'တောင်းဆိုမှုတွင်စက်အိုင်ဒီမှားယွင်းနေပါသည်။',
                'invalid_device_name' => 'တောင်းဆိုမှုတွင်စက်အမည်မှားယွင်းနေပါသည်။',
                'invalid_max' => 'ရည်ညွှန်းချက်သည် အများဆုံး စာလုံးများထက် ကြီးမည်မဟုတ်ပါ။',
                'invalid_confirm_password' => 'Confirm Password မမှန်ကန်ပါ။',
                'incorrect_current_password' => 'မမှန်ကန်သော Current Password ကို ပေးထားသည်။',
                'invalid_current_password' => 'Current Password မမှန်ကန်ပါ။',
                'invalid_new_password' => 'New Password မမှန်ကန်ပါ။',
                
            ],

            'success' => [
                'message' => 'အောင်မြင်ပါသည်',
                'password_reset' => 'စကားဝှက်ပြန်လည်သတ်မှတ်ခြင်းအောင်မြင်ပါသည်',
                'logout' => 'အသုံးပြုသူအကောင့်မှထွက်ခြင်းအောင်မြင်ပါသည်',
                'otp_verified' => 'တစ်ခါသုံး လှို့ဝှက်နံပါတ် အတည်ပြုမှု အောင်မြင်ပါသည်',
            ],

            'failure' => [
                'message' => 'မှားနေပါသည်။'
            ],
        ],

    ]
];